StoveOpt/foamfiles/counterFlowFlame2D/old/case_6666666667/0/details
Velocity
66.66666667